guides/pd-disaggregation/posting-overhead-analysis/benchmark-logs/isl-sweep-libfabric-efa-20260806-204846/benchmark-isl24000.txt
Synced poker/Justfile.remote -> raj-dev/poker:/workspace/Justfile (BASE_URL=http://infra-pd-inference-gateway-istio.raj-dev.svc.cluster.local)
INFO 08-06 20:59:57 [importing.py:44] Triton is installed but 0 active driver(s) found (expected 1). Disabling Triton to prevent runtime errors.
INFO 08-06 20:59:57 [importing.py:68] Triton not installed or not compatible; certain GPU-related functions will not be available.
WARNING 08-06 20:59:57 [interface.py:229] Failed to import from vllm._C: ImportError('libcuda.so.1: cannot open shared object file: No such file or directory')
INFO 08-06 21:00:00 [main.py:49] Unspecified platform detected, switching to CPU Platform instead.
Warning: You are sending unauthenticated requests to the HF Hub. Please set a HF_TOKEN to enable higher rate limits and faster downloads.
Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0x7f5bf0d29080>, trust_remote_code=False, seed=59205950, num_prompts=300, dataset_name='random', no_stream=False, dataset_path=None, no_oversample=False, skip_chat_template=False, enable_multimodal_chat=False, disable_shuffle=False, custom_output_len=256, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, blazedit_min_distance=0.0, blazedit_max_distance=1.0, asr_max_audio_len_sec=inf, asr_min_audio_len_sec=0.0, random_input_len=24000, random_output_len=1, random_range_ratio=0.0, random_prefix_len=0, random_batch_size=1, no_reranker=False, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 1}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, label=None, backend='openai', base_url='http://infra-pd-inference-gateway-istio.raj-dev.svc.cluster.local', host='127.0.0.1', port=8000, endpoint='/v1/completions', header=None, max_concurrency=32, model='RedHatAI/Llama-3.3-70B-Instruct-FP8-dynamic', input_len=None, output_len=None, tokenizer=None, tokenizer_mode='auto', use_beam_search=False, logprobs=None, request_rate=4096.0, burstiness=1.0, disable_tqdm=False, num_warmups=0, profile=False, save_result=False, save_detailed=False, append_result=False, metadata=None, result_dir=None, result_filename=None, ignore_eos=True, percentile_metrics=None, metric_percentiles='99', goodput=None, request_id_prefix='bench-30ff4dd1-', top_p=None, top_k=None, min_p=None, temperature=None, frequency_penalty=None, presence_penalty=None, repetition_penalty=None, served_model_name=None, lora_modules=None, lora_assignment='random', ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=0, extra_body=None, skip_tokenizer_init=False, insecure=False, plot_timeline=False, timeline_itl_thresholds=[25.0, 50.0], plot_dataset_stats=False)
INFO 08-06 21:00:02 [datasets.py:700] Sampling input_len from [23999, 23999] and output_len from [1, 1]
  0%|          | 0/300 [00:00<?, ?it/s]WARNING: vllm bench serve no longer sets temperature==0 (greedy) in requests by default. The default will be determined on the server side and can be model/API specific. For the old behavior, include --temperature=0.
Starting initial single prompt test run...
Skipping endpoint ready check.
Starting main benchmark run...
Traffic request rate: 4096.0
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: 32
100%|██████████| 300/300 [07:12<00:00,  1.44s/it]
Failed requests during benchmark run detected (capping to 10):
Error 0: Traceback (most recent call last):
  File "/usr/local/lib/python3.12/site-packages/vllm/benchmarks/lib/endpoint_request_func.py", line 205, in async_request_openai_completions
    messages = handler.add_chunk(chunk_bytes)
               ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^
  File "/usr/local/lib/python3.12/site-packages/vllm/benchmarks/lib/endpoint_request_func.py", line 32, in add_chunk
    chunk_str = chunk_bytes.decode("utf-8")
                ^^^^^^^^^^^^^^^^^^^^^^^^^^^
UnicodeDecodeError: 'utf-8' codec can't decode byte 0xe8 in position 4089: unexpected end of data

tip: install termplotlib and gnuplot to plot the metrics
============ Serving Benchmark Result ============
Successful requests:                     299       
Failed requests:                         1         
Maximum request concurrency:             32        
Request rate configured (RPS):           4096.00   
Benchmark duration (s):                  432.30    
Total input tokens:                      7175701   
Total generated tokens:                  299       
Request throughput (req/s):              0.69      
Output token throughput (tok/s):         0.69      
Peak output token throughput (tok/s):    1.00      
Peak concurrent requests:                33.00     
Total token throughput (tok/s):          16599.42  
---------------Time to First Token----------------
Mean TTFT (ms):                          43758.03  
Median TTFT (ms):                        45852.64  
P99 TTFT (ms):                           47486.67  
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          0.00      
Median TPOT (ms):                        0.00      
P99 TPOT (ms):                           0.00      
---------------Inter-token Latency----------------
Mean ITL (ms):                           0.00      
Median ITL (ms):                         0.00      
P99 ITL (ms):                            0.00      
==================================================